app/controllers/admin/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("title", "description", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "title-1"], ["description", "desc-1"], ["quantity", 3], ["price", 100], ["created_at", "2015-11-11 13:06:43.038251"], ["updated_at", "2015-11-11 13:06:43.038251"]]

  def update

    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "title-1-update"], ["updated_at", "2015-11-12 05:02:46.317874"], ["id", 1]]