app/views/admin/products/index.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]
---
        <%= link_to(admin_product_path(product)) do %>
          <% if product.photo.present? %>