app/views/products/index.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]
---

        <% if product.photo.present? %>