app/views/products/show.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]
---
  <div class="col-md-6">
    <% if @product.photo.present? %>